In [1]:
# importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
sdict = {"name":"Sade", "age": 16, "dept":"CSC", "acct":34900}

In [5]:
sdict.keys()

dict_keys(['name', 'age', 'dept', 'acct'])

In [6]:
sdict.values()

dict_values(['Sade', 16, 'CSC', 34900])

In [7]:
sdict["name"]

'Sade'

In [10]:
sdict = {"name":["Sade", "Nike", "Tade"], "age": [16,12,23], "dept":["CSC","MTS","IFS"], "acct":[34900,23900,5000]}

In [11]:
df = pd.DataFrame(sdict)

In [12]:
df

   name  age dept   acct
0  Sade   16  CSC  34900
1  Nike   12  MTS  23900
2  Tade   23  IFS   5000

In [13]:
df["name"]

0    Sade
1    Nike
2    Tade
Name: name, dtype: object

In [15]:
df["acct"].mean()

21266.666666666668

In [16]:
df["acct"].describe()

count        3.000000
mean     21266.666667
std      15122.940631
min       5000.000000
25%      14450.000000
50%      23900.000000
75%      29400.000000
max      34900.000000
Name: acct, dtype: float64

In [17]:
df.describe()

             age          acct
count   3.000000      3.000000
mean   17.000000  21266.666667
std     5.567764  15122.940631
min    12.000000   5000.000000
25%    14.000000  14450.000000
50%    16.000000  23900.000000
75%    19.500000  29400.000000
max    23.000000  34900.000000

In [18]:
df.columns

Index(['name', 'age', 'dept', 'acct'], dtype='object')

In [19]:
df.dtypes

name    object
age      int64
dept    object
acct     int64
dtype: object

In [20]:
df.describe(include="object")

        name dept
count      3    3
unique     3    3
top     Tade  MTS
freq       1    1

In [23]:
df.describe(include=["object","int64"])

        name        age dept          acct
count      3   3.000000    3      3.000000
unique     3        NaN    3           NaN
top     Tade        NaN  MTS           NaN
freq       1        NaN    1           NaN
mean     NaN  17.000000  NaN  21266.666667
std      NaN   5.567764  NaN  15122.940631
min      NaN  12.000000  NaN   5000.000000
25%      NaN  14.000000  NaN  14450.000000
50%      NaN  16.000000  NaN  23900.000000
75%      NaN  19.500000  NaN  29400.000000
max      NaN  23.000000  NaN  34900.000000

In [26]:
df.Role

AttributeError: 'DataFrame' object has no attribute 'Role'